# 데이터 조작

In [2]:
import pandas as pd
import numpy as np
s = pd.Series(range(10))
s.count()

10

# count는 null값이 아닌 행만 세며 
- size()는 null값인 행도 모두 포함해서 행을 센다

In [3]:
s[3] = np.nan
s.count()

9

# 데이터프레임에서는 열마다 별도로 데이터 갯수를 센다.
- 이유는 시리즈, 즉 열이 모여서 데이터 프레임이 되었기때문에

In [9]:
np.random.seed(2)
df= pd.DataFrame(np.random.randint(5,size=(4,4)), dtype = float)
df.iloc[2,3] = np.nan
print(df)
df.count()

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

0    4
1    4
2    4
3    3
dtype: int64

# 열= aixis영    행 axis1

In [8]:
print(df.count(axis=0))
print(df.count(axis=1))

0    4
1    4
2    4
3    3
dtype: int64
0    4
1    4
2    3
3    4
dtype: int64

# 앞에서 몇개 head(n) 뒤에서 몇개 tail(n)
# pd변수.head(), pd변수.tail()

In [10]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6,size = 100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [12]:
s2.value_counts() #전체새기

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

# 데이터 프레임에는 value_counts 매서드가 없으므로 각 열마다 별도로 적용해야한다.

In [14]:
df[0].value_counts()

3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64

# 정렬

    -sort_index(), sort_values()

In [16]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [17]:
s.sort_values() # Nan 값이 있는 경우에는 정렬하면 NaN값이 가장 나중으로간다.

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [18]:
# 내림차순 
s.sort_values(ascending = False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

# 열을 기준으로 행들을 바꾼다 !
# ex 키, 몸무게 기준으로 사람들을 정렬해라

In [21]:
print(df)
print(df.sort_values(by=1)) # by인수로 열지정
print('-------------')
print(df.sort_values(by=[1, 2]))

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0
     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0
-------------
     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [43]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size= (4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

# loc pd변수.loc["인덱스명", a:b] = 값
## 값을 "인덱스명" 인 행을 하나 추가하는데 a열부터 b열까지

In [44]:
df2.sum(axis=0) #열의 합계
#별칭 붙이기
df2.loc["columnsSum", :] = df2.sum()
print(df2)

               0     1     2     3     4     5    6     7
0            5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0
1            6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0
2            4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0
3            9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0
columnsSum  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0
               0     1     2     3     4     5    6     7
0            5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0
1            6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0
2            4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0
3            9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0
columnsSum  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0
니니니          1.0   1.0   1.0   1.0   1.0   NaN  NaN   NaN

In [39]:
df2.sum(axis = 1)

0              35.0
1              34.0
2              41.0
3              42.0
columnsSum    775.0
니니니             5.0
dtype: float64

In [42]:
df2["RowSum"] = df2.sum(axis = 1)
df2

                0      1      2      3     4     5     6     7  RowSum
0             5.0    8.0    9.0    5.0   0.0   0.0   1.0   7.0    35.0
1             6.0    9.0    2.0    4.0   5.0   2.0   4.0   2.0    34.0
2             4.0    7.0    7.0    9.0   1.0   7.0   0.0   6.0    41.0
3             9.0    9.0    7.0    6.0   9.0   1.0   0.0   1.0    42.0
columnsSum  148.0  202.0  154.0  148.0  94.0  60.0  30.0  96.0   932.0
니니니           1.0    1.0    1.0    1.0   1.0   NaN   NaN   NaN     5.0

# 행이나 열 단위로 더 복잡한 처리를 하고싶을 떄
## apply 메서드 사용 
## map 함수와 같은기능
### 함수에 열이나 행을 집어넣어서 계쏙 해야되는대
### 열이나 행개수가 많으면 비효율적이라 apply메서드 사용
- 사용자 정의 함수는 이름만 쓰고
- 모듈의 함수는 pd변수.apply(모듈명.함수명)

In [45]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
}) #dict형식
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [46]:
df3.apply(lambda x: x.max() - x.min()) #기본은 열

A    3
B    2
C    4
dtype: int64

In [47]:
df3.apply(lambda x:x.max()-x.min(), axis = 1) # axis = 1 행기준

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [58]:
def diff(x):
    
    return x.max() - x.min()
    
print(diff(df3['A']))
print(diff(df3['B']))
print(diff(df3['C']))
df3.apply(diff)

df3.apply(diff, axis = 1)

3
2
4

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [64]:
print(df3["A"].value_counts())
print(df3["B"].value_counts())
print(df3["C"].value_counts())

df3.apply(pd.value_counts,axis=1)

# NaN값을 원하는 값으로 변경 : fillna() 타입 설정: astpye(int)

df.apply(pd.value_counts).fillna(0).astype(int)

4    2
3    2
1    1
Name: A, dtype: int64
3    2
2    2
1    1
Name: B, dtype: int64
4    2
5    1
2    1
1    1
Name: C, dtype: int64

     0  1  2  3
0.0  1  2  0  0
1.0  0  0  0  1
2.0  0  1  1  2
3.0  2  1  1  0
4.0  1  0  2  0

# 실수 값을 카테고리 값으로 변환
- cut : 실수값의 경계선을 지정하는경우
    - 변수 = pd.cut(입력데이터, 기준값리스트, labels = 레이블리스트)
    - 카테고리만 뽑기 : pd변수.categories
- qcut : 갯수가 똑같은 구간으로 나누는 경우

In [76]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
labels = ["미성년자","청년","중년","장년","노년"]
bins = [1,15,25,35,60,99]
cats = pd.cut(ages, bins, labels=labels)
cats
print(type(cats))
print(cats.categories)
print(cats.codes)

df = pd.DataFrame(ages,columns = ["ages"])
print(df)

df["age_cat"] = pd.cut(df.ages, bins, labels=labels)
df

<class 'pandas.core.arrays.categorical.Categorical'>
Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')
[-1  0  0  1  1  3  2  4  1  3  2 -1]
    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

In [80]:
# qcut : 명령은 구간 경계선을 지정하지않고 
#데이터 갯수가 같도록 지정한 수의 구간으로 나눈다.

data = np.random.randn(1000)
cats = pd.qcut(data,4,labels = ["Q1","Q2","Q3","Q4"])
cats
cats.value_counts()

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

# 인덱스 조작

### 인덱스 설정 및 제거
    -set_index() 특정열을 인덱스열로 사용하는방법
    -reset_index()

In [81]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [82]:
df2 = df1.set_index("C1")
#df2.set_index("C2")

#df2.reset_index()
df2.reset_index(drop=True)

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

# 다중 인덱스

In [87]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df3

df3.columns.names = ["Cidx1","Cidx2"]
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [93]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6,4),2),
                  columns = [["A","A","B","B"],
                            ["C","D","C","D"]],
                    index = [["M","M","M","F","F","F"],
                            ["id_" +str(i +1) for i in range(3)]*2])

df4.columns.names = ["Cidx1","Cidx2"]
df4.index.names = ["Ridx1","Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

# 행 인덱스와 열 인덱스 교환
- stack() 열 -> 행 : 열에 있는인덱스들이 행으로 들어감
- unstack() 행 -> 열

In [100]:
df4.stack("Cidx1")

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

In [98]:
df4.stack(1)

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      1.76  0.98
            D      0.40  2.24
      id_2  C      1.87  0.95
            D     -0.98 -0.15
      id_3  C     -0.10  0.14
            D      0.41  1.45
F     id_1  C      0.76  0.44
            D      0.12  0.33
      id_2  C      1.49  0.31
            D     -0.21 -0.85
      id_3  C     -2.55  0.86
            D      0.65 -0.74

In [101]:
df4.unstack("Ridx2")

Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.76  1.49 -2.55  0.12 -0.21  0.65  0.44  0.31  0.86  0.33 -0.85 -0.74
M      1.76  1.87 -0.10  0.40 -0.98  0.41  0.98  0.95  0.14  2.24 -0.15  1.45

In [102]:
print(df3)

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [105]:
df3[("B","C1")]
df3[("B","C1")][0]
df3[("B","C1")][0:2]

0    0.98
1    0.95
Name: (B, C1), dtype: float64

In [106]:
df3.loc[0, ("B", "C1")]

0.98

In [107]:
df3.iloc[0, 2]

0.98

In [112]:
## df4를 이용해서 인덱싱
print(df4)
# 첫번째 행, 첫번째 열에 있는 1.76 출력
print(df4[("A","C")][0])
# 첫번째 열 1.76 ~ -2.55 까지 출력
print(df4["A","C"])
#첫번째 행의 모든 컬럼값을 출력
print(df4.loc["M","id_1"])
# 맨마지막 행에 "ALL" 이란 인덱스를 추가해서 각 열의 합을 출력
df4.loc["ALL"] = df4.apply(pd.sum,axis = 1)

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
1.76
Ridx1  Ridx2
M      id_1     1.76
       id_2     1.87
       id_3    -0.10
F      id_1     0.76
       id_2     1.49
       id_3    -2.55
Name: (A, C), dtype: float64
Cidx1  Cidx2
A      C        1.76
       D        0.40
B      C        0.98
       D        2.24
Name: (M, id_1), dtype: float64

AttributeError: module 'pandas' has no attribute 'sum'

In [114]:
df5 = df4.swaplevel("Ridx1","Ridx2",axis=0)
df5

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74

In [115]:
df6 = df4.swaplevel("Cidx1","Cidx2",1)
df6

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [116]:
df4.sort_index(level = 0)
df4.sort_index(level = 0, axis = 0)

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45

# 병합(합성)

#### merge()
    두 데이터 프레임의 공통 열 또는 인덱스를 기준으로 두 개의 테이블을 합친다.
    이 때 기준이 되는 말, 행의 데이터를 key라고 한다.

In [117]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [118]:
pd.merge(df1,df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [119]:
pd.merge(df1,df2,how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [120]:
pd.merge(df1,df2,'left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [121]:
pd.merge(df1,df2,how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

In [122]:
df1 = pd.DataFrame({
    '이름': ['영희', '철수', '철수'],
    '성적': [1, 2, 3]})
df1

   이름  성적
0  영희   1
1  철수   2
2  철수   3

In [123]:
df2 = pd.DataFrame({
    '성명': ['영희', '영희', '철수'],
    '성적2': [4, 5, 6]})
df2

   성명  성적2
0  영희    4
1  영희    5
2  철수    6

In [124]:
pd.merge(df1,df2,left_on="이름",right_on="성명")

   이름  성적  성명  성적2
0  영희   1  영희    4
1  영희   1  영희    5
2  철수   2  철수    6
3  철수   3  철수    6

In [125]:
# 인덱스를 기준일로 사용하는 경우 
df1 = pd.DataFrame({
    '도시': ['서울', '서울', '서울', '부산', '부산'],
    '연도': [2000, 2005, 2010, 2000, 2005],
    '인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
print(df1)
print("---------------")

df2 = pd.DataFrame(
    np.arange(12).reshape((6, 2)),
    index=[['부산', '부산', '서울', '서울', '서울', '서울'],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['데이터1', '데이터2'])
df2

print(df2)
print("----------------")

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547
---------------
         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11
----------------

In [126]:
#일반 데이터 열이 아닌 
#인덱스를 기준열로 사용하려면 left_index 또는 right_index 인수를 True 로 설정한다.
pd.merge(df1, df2, left_on=['도시', '연도'], right_index=True)

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

In [127]:
df1 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['서울', '부산'])
df1

    서울   부산
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [128]:
df2 = pd.DataFrame(
    [[7., 8.], [9., 10.], [11., 12.], [13, 14]],
    index=['b', 'c', 'd', 'e'],
    columns=['대구', '광주'])
df2

     대구    광주
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [129]:
pd.merge(df1, df2, how='outer', left_index=True, right_index=True)

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0